{
  "HomePage": {
    "title": "Hola, Soy",
    "paragraph": "El código es mi lenguaje y la creatividad mi herramienta. Me apasiona construir experiencias digitales que no solo funcionen, sino que dejen huella. Disfruto cada reto como una oportunidad para innovar, mejorar y aprender. Si estás buscando a alguien que combine técnica y visión para hacer crecer un proyecto, aquí estoy. ¡On Fire!",
    "button-1": "Contrateme",
    "button-2": "Descargar CV"
  },
  "Navbar": {
    "main": "principal",
    "about": "sobre",
    "projects": "proyectos",
    "contact": "contacto"
  },
  "About": {
    "title": "Sobre mi",
    "paragraph": "Durante más de tres años, mi mundo giró en torno a motores, piezas y diagnósticos de problemas mecánicos. Pero un día decidí tomar una ruta distinta: cambiar las herramientas físicas por líneas de código. Así comenzó mi viaje en el desarrollo web. A través de la constancia y el aprendizaje autodidacta, he explorado múltiples tecnologías, metodologías y estructuras, siempre con la convicción de que la mejor forma de aprender es enfrentarse a nuevos retos cada día. La lógica y resolución de problemas que desarrollé en mi anterior profesión han sido clave en este proceso, permitiéndome abordar cada proyecto con precisión y creatividad.",
    "skills": "Habilidades",
    "education": "Educacion",
    "certifications": "Certificaciones"
  },
  "Projects": {
    "title": "Mis Proyectos",
    "featured": "Destacado",
    "starter": "Basico",
    "desing": "Diseño",
    "btn": "Ver Mas"
  },
  "Email": {
    "title": "Conectemos",
    "paragraph": "¡Las grandes cosas comienzan con un simple saludo! Si eres un reclutador, un entusiasta de la tecnología o un socio creativo, me encantaría saber de ti. Exploremos cómo podemos hacer realidad ideas audaces juntos.",
    "youEmail": "Tu Email",
    "subject": "Asunto",
    "message": "Mensaje",
    "button": "Enviar mensaje"
  },
  "footer": {
    "text": "© 2024 StivCode. Todos los derechos reservados. Este sitio web y su contenido están protegidos por la ley de derechos de autor. El uso, reproducción o distribución no autorizados están estrictamente prohibidos. Para permisos o consultas, por favor contáctenos directamente."
  },
  "Projects-info": {
    "description": "Description",
    "objective": "Objetivo",
    "features": "Funciones Claves",
    "skills": "Habilidades",
    "challenge": "Desafios",
    "Project-UrbanShop": {
      "subtitle": "E-commerce para la venta de zapatos y gorras",
      "description": "Urban Shop es una tienda en línea diseñada para la venta de zapatos y gorras, con una interfaz atractiva y dinámica. El objetivo principal fue desarrollar un e-commerce con todas sus funcionalidades principales, brindando una experiencia de usuario fluida e intuitiva.",
      "objective": "Crear una plataforma de comercio electrónico funcional y escalable, con un diseño atractivo y una experiencia de usuario optimizada para futuras expansiones.",
      "feature-one": "Agregar productos al carrito con almacenamiento en localStorage.",
      "feature-two": "Aumentar y disminuir la cantidad de productos.",
      "feature-Three": "Eliminar productos individuales.",
      "feature-four": "Vaciar el carrito por completo.",
      "feature-five": "Cálculo automático del total en la parte inferior del carrito.",
      "feature-six": "Deslizador interactivo para mostrar una serie de gorras.",
      "skill-one": "Manejo de estados globales con Redux Toolkit.",
      "skill-two": "Uso de localStorage para persistencia de datos.",
      "skill-three": "Aplicación de funciones matemáticas para cálculos en el carrito.",
      "skill-four": "Integración de bibliotecas de sliders (@splidejs/react-splide).",
      "skill-five": "Trabajo con archivos JSON para manejar la data de los productos.",
      "challenge-one": "Fue la primera vez que utilicé Redux Toolkit, lo que representó un reto inicial. Sin embargo, mediante tutoriales y documentación, logré comprender su flujo de trabajo y aplicarlo exitosamente para gestionar el estado global del carrito.",
      "challenge-two": "Al recargar la página, los productos desaparecían. La solución fue almacenar el estado del carrito en localStorage, asegurando que la información se mantuviera intacta después de cada recarga."
    },
    "Project-Frameonix": {
      "subtitle": "Web para la documentación de mi librería",
      "description": "Frameonix es la plataforma web diseñada para documentar mi librería de componentes, proporcionando una introducción detallada, una guía de instalación y uso, información sobre cómo contribuir y documentación específica de cada componente disponible en la librería. Esta web cuenta con una interfaz dinámica, navegación mediante rutas, y un diseño intuitivo para garantizar una excelente experiencia de usuario.",
      "objective": "Facilitar el aprendizaje y uso de Frameonix, asegurando que los desarrolladores tengan un punto de partida claro y comprendan cómo utilizar cada componente de la librería de manera eficiente.",
      "feature-one": "Manejo de rutas con react-router-dom para una mejor navegación.",
      "feature-two": "Cambio de idioma manualmente mediante i18next.",
      "feature-three": "Diseño responsive con excelente presentación en todas las pantallas.",
      "feature-four": "Detección de sección en pantalla, mostrando en un índice la ubicación actual del usuario.",
      "feature-five": "Componente de terminal interactiva, que permite copiar contenido fácilmente.",
      "skill-one": "Publicación de una librería en NPM.",
      "skill-two": "Estructuración completa y componentización de un proyecto grande.",
      "skill-three": "Implementación de traducciones locales con i18next.",
      "skill-four": "Manejo de rutas en React utilizando react-router-dom.",
      "skill-five": "Creación de un diseño pensado en la experiencia del usuario.",
      "skill-six": "Aplicación de una paleta de colores unificada para coherencia visual.",
      "challenge-one": "Debido a la gran cantidad de secciones, implementar un sistema de rutas fue esencial para mantener el proyecto ordenado y fácil de escalar.",
      "challenge-two": "Configurar múltiples claves para cada traducción de manera manual fue tedioso, pero logré optimizarlo mediante i18next.",
      "challenge-three": "Para indicar visualmente en qué sección se encuentra el usuario, implementé IntersectionObserver, detectando el contenedor activo por id y marcándolo en el índice de navegación. El resultado fue una experiencia de usuario más clara y fluida."
    },
    "Project-CineVerse": {
      "subtitle": "Plataforma interactiva de películas",
      "description": "Cineverse es una plataforma de películas que consume la API de TMDB para obtener información actualizada sobre las últimas películas. Su diseño dinámico permite una experiencia interactiva, con una pancarta principal que muestra una película aleatoria al recargar y filtros para explorar películas por categoría.",
      "objective": "Crear una plataforma de películas interactiva que se mantenga siempre actualizada mediante el consumo de APIs, proporcionando una navegación fluida y atractiva para los usuarios.",
      "feature-one": "Pancarta principal interactiva que cambia aleatoriamente con cada recarga o categoría.",
      "feature-two": "Filtros dinámicos de películas por categoría.",
      "feature-three": "Consumo de la API de TMDB para obtener información en tiempo real.",
      "feature-four": "Diseño completamente responsive para una experiencia fluida en cualquier dispositivo.",
      "skill-one": "Consumo de APIs externas y manejo de peticiones.",
      "skill-two": "Implementación de filtros dinámicos para mejorar la experiencia de usuario.",
      "skill-three": "Manejo de estados en React para controlar cambios de datos y diseño.",
      "skill-four": "Ampliación de conocimientos en React y optimización del flujo de datos.",
      "challenge-one": "El consumo de APIs fue un desafío, ya que era la primera vez que trabajaba con una API externa, pero logré solucionarlo gracias a un curso previo.",
      "challenge-two": "Implementar la pancarta interactiva fue complicado, ya que debía cambiar aleatoriamente dependiendo de la categoría seleccionada. La solución fue manejar estados en React para actualizar dinámicamente la imagen y la información mostrada."
    },
    "Project-WhatsappClone": {
      "subtitle": "Web frontend para la clonación de WhatsApp Web",
      "description": "WhatsApp Clone es una web frontend desarrollada en conjunto con 6 compañeros, donde replicamos y personalizamos varias secciones de la web oficial de WhatsApp. El objetivo principal fue adquirir experiencia en trabajo en equipo y expandir mis conocimientos utilizando frameworks, ya que era la primera vez que trabajaba con ellos. A lo largo del proyecto, implementamos funcionalidades clave y personalizamos la experiencia de usuario.",
      "objective": "Aprender y mejorar las habilidades de trabajo en equipo, así como familiarizarme con el uso de frameworks y librerías como React, Material UI, y Tailwind CSS, replicando la funcionalidad y el diseño de WhatsApp Web.",
      "feature-one": "Rutas de autenticación.",
      "feature-two": "Funcionalidad para crear un perfil de usuario.",
      "feature-three": "Envío de mensajes entre usuarios.",
      "feature-four": "Envío de emojis mediante una librería dedicada.",
      "feature-five": "Consumo de la librería Material UI para utilizar sus componentes.",
      "feature-six": "Implementación de un tema de colores con Tailwind CSS.",
      "feature-seven": "Sección de estados de los usuarios.",
      "feature-eight": "Sección de edición de perfil.",
      "feature-nine": "Filtrado de mensajes.",
      "skill-one": "Trabajo en equipo y gestión de proyectos colaborativos.",
      "skill-two": "Habilidades de comunicación, responsabilidad, igualdad, amabilidad y escucha activa en reuniones, utilizando metodología Scrum.",
      "skill-three": "Manejo de rutas y gestión de la navegación en React.",
      "skill-four": "Consumo de librerías como Material UI y Emojis para enriquecer la experiencia del usuario.",
      "challenge-one": "Aprender a manejar rutas fue uno de los mayores retos, pero mis compañeros me ayudaron a comprenderlas rápidamente.",
      "challenge-two": "El manejo de hooks en React fue una habilidad nueva que aprendí gracias al trabajo en equipo.",
      "challenge-three": "El consumo de la librería Material UI fue un desafío, pero lo resolvimos consultando la documentación oficial y aplicando los componentes necesarios."
    },
    "Project-StivSound": {
      "subtitle": "Online music player with pure JavaScript",
      "description": "StivSound is an online music player that allows users to listen to predefined songs with a responsive design, adapted for different screens. Fully developed with pure JavaScript, this project offers a smooth and dynamic user experience, integrating essential functionalities for audio playback without needing to reload the page.",
      "objective": "Learn to manage, interact with, and control audio files in a web application using JavaScript, improve DOM manipulation, and reinforce the use of classes and functions to structure the code better.",
      "feature-one": "Playback of songs stored in Firebase Storage.",
      "feature-two": "Options to skip forward and backward between songs.",
      "feature-three": "Functionality to remove a song from the list.",
      "feature-four": "Pause and resume playback button.",
      "feature-five": "Option to shuffle the song list randomly.",
      "feature-six": "Total song duration indicator and real-time playback progress counter.",
      "skill-one": "Better understanding and manipulation of the DOM with JavaScript.",
      "skill-two": "Handling and controlling audio files on a website.",
      "skill-three": "Implementation of playback counters.",
      "skill-four": "Development of a responsive interface adaptable to different devices.",
      "skill-five": "Consumption of assets from Firebase Storage, including preview images and audio files.",
      "challenge-one": "Properly displaying the duration of each song along with its playback counter was a challenge since I initially didn't know how to do it. I solved it thanks to concepts learned in a video about audio handling and events in JavaScript.",
      "challenge-two": "Working with classes in JavaScript was something new to me at the time, but this project helped me improve my knowledge and structure the code better with more organized and reusable programming."
    },
    "Project-UserRegister": {
      "subtitle": "Formulario de registro de usuario con validaciones dinámicas",
      "description": "User Register es un formulario de registro interactivo desarrollado con JavaScript puro (Vanilla JS) y CSS, donde el usuario completa sus datos paso a paso. A medida que el formulario avanza, se muestra visualmente el progreso en la parte superior, guiando al usuario a través del proceso de registro. Incluye validaciones estrictas que impiden continuar hasta que se cumplan los requisitos establecidos, asegurando una experiencia de usuario fluida y funcional.",
      "objective": "Dominar la validación de formularios en JavaScript puro, aprender a manipular el DOM de manera efectiva y desarrollar una solución reutilizable para futuros proyectos que requieran un sistema de registro.",
      "feature-one": "Barra de navegación que muestra los pasos completados y pendientes.",
      "feature-two": "Validación de un mínimo de caracteres permitidos en el primer formulario.",
      "feature-three": "Validación de campos completados antes de permitir el avance al siguiente paso.",
      "feature-four": "Validación de correo electrónico y número de teléfono con un mínimo de 10 dígitos.",
      "feature-five": "Funcionalidad para mostrar y ocultar la contraseña.",
      "feature-six": "Opción de reiniciar el formulario si el usuario regresa atrás o finaliza el registro.",
      "skill-one": "Manejo avanzado de estilos con CSS puro.",
      "skill-two": "Validación de formularios sin el uso de frameworks.",
      "skill-three": "Manipulación del DOM en JavaScript para crear una experiencia dinámica.",
      "challenge-one": "Inicialmente, no sabía cómo acceder al DOM para hacer dinámico el formulario. Logré resolverlo mediante la manipulación del DOM con JavaScript.",
      "challenge-two": "Implementar la barra de navegación fue un reto, ya que requería lógica combinada entre JavaScript y CSS para mostrar correctamente el paso actual e indicar el progreso.",
      "challenge-three": "Hacer que los botones permitieran desplazarse entre secciones sin recargar la página fue un desafío, pero gracias a la combinación de CSS y JavaScript, logré una navegación fluida con botones de avanzar y retroceder."
    },
    "Project-ClothingStore": {
      "subtitle": "Diseño de tienda de ropa con React y Tailwind CSS",
      "description": "Clothing Store es un proyecto enfocado en la presentación de productos en una tienda de ropa, con un diseño adaptativo y una interfaz intuitiva. Incluye una serie de cards para mostrar productos, un menú lateral para cambiar de sección, una barra de navegación superior para filtrar por tipo de prenda y una barra de búsqueda. Este proyecto está centrado en el diseño y la maquetación con React y Tailwind CSS.",
      "objective": "Practicar el diseño responsivo y mejorar mis habilidades en React y Tailwind CSS. Aunque este proyecto tiene pocas funciones interactivas, fue clave para afianzar el manejo de estados con useState y la estructura de un diseño adaptable.",
      "feature-one": "Menú de carrito con apertura y cierre mediante estado.",
      "feature-two": "Barra de navegación lateral para cambiar de sección.",
      "feature-three": "Diseño de grillas completamente adaptadas a diferentes tamaños de pantalla.",
      "skill-one": "Mejorar mis habilidades en Tailwind CSS.",
      "skill-two": "Uso del hook useState en React.",
      "skill-three": "Diseño responsivo optimizado.",
      "skill-four": "Familiarización con frameworks y herramientas como Vite para React.",
      "challenge-one": "Manejo de la lógica de useState para la interacción del carrito, ya que en ese momento aún no dominaba bien el manejo de estados en React.",
      "challenge-two": "Familiarizarme con Tailwind CSS y mejorar su implementación en diseños adaptativos."
    },
    "Project-DesignYouTube": {
      "subtitle": "Clon de la interfaz de inicio de YouTube",
      "description": "Design YouTube fue mi segundo proyecto de diseño web con HTML y CSS puro, en el que repliqué la interfaz de inicio de YouTube en su versión blanca. Además de trabajar en el diseño responsive, agregué una funcionalidad con JavaScript para abrir y cerrar el sidebar.",
      "objective": "Reforzar mis conocimientos en el modelo de cajas con HTML y CSS, mientras implementaba una funcionalidad interactiva con JavaScript para manejar el sidebar. Este proyecto me permitió practicar la manipulación del DOM, eventos y estructuras condicionales.",
      "feature-one": "Botón para abrir y cerrar el menú lateral.",
      "feature-two": "Diseño responsive adaptable a diferentes pantallas.",
      "skill-one": "Manejo de CSS Grid y sus propiedades.",
      "skill-two": "Primer contacto con JavaScript.",
      "skill-three": "Manipulación del DOM con eventos en JavaScript.",
      "challenge-one": "Este proyecto me tomó aproximadamente 10 días después de ver un curso de JavaScript.",
      "challenge-two": "Tuve dificultades al principio con la implementación del sidebar, pero la documentación y mis apuntes del curso me ayudaron a resolverlo."
    },
    "Project-DesignFacebook": {
      "subtitle": "Clon de la página de inicio de sesión de Facebook clásico",
      "description": "Design Facebook es un proyecto de diseño web en HTML y CSS que replica la interfaz de inicio de sesión de la versión clásica de Facebook. Fue mi primer proyecto después de ver un curso de HTML y CSS, donde puse en práctica conceptos de diseño responsive, modelo de cajas y Flexbox.",
      "objective": "Poner a prueba mis conocimientos adquiridos en un curso de diseño web, enfocándome en la maquetación responsive y en el uso de Flexbox. Además, documenté cada paso del proceso durante 8 días para reforzar mi aprendizaje.",
      "feature-one": "Diseño responsive adaptable a diferentes pantallas.",
      "feature-two": "HTML y CSS organizados en archivos separados.",
      "feature-three": "Uso de media queries para mejorar la adaptabilidad.",
      "skill-one": "Diseño responsive.",
      "skill-two": "Manejo del modelo de cajas en CSS.",
      "skill-three": "Uso de Flexbox.",
      "skill-four": "Uso de la cascada de CSS y organización de clases.",
      "challenge-one": "Como era mi primer proyecto real, me tomó tiempo comprender y aplicar correctamente los conceptos de diseño web.",
      "challenge-two": "Tuve dificultades iniciales con Flexbox y la estructura del modelo de cajas, pero logré solucionarlas documentando mi proceso y aprendiendo de los errores."
    },
    "Project-MoneyTracking": {
      "subtitle": "Gestor de ingresos y egresos con gráficos dinámicos",
      "description": "Money Tracking es una aplicación web que permite gestionar ingresos y egresos, mostrando un balance actualizado y un registro detallado de las transacciones. Además, integra una gráfica interactiva que representa el balance disponible utilizando la librería ECharts. Desarrollado con JavaScript puro, este proyecto fue una introducción a la manipulación del DOM, el cálculo de totales y porcentajes, y el uso de librerías externas.",
      "objective": "Crear un sistema de control financiero con balance de ingresos y egresos, acompañado de una visualización gráfica, para mejorar mis habilidades en el manejo del DOM, cálculos dinámicos en JavaScript y el uso de librerías externas.",
      "feature-one": "Consumo de la librería de gráficos ECharts para visualización del balance.",
      "feature-two": "Input para agregar ingresos y egresos.",
      "feature-three": "Cálculo dinámico del ingreso disponible.",
      "feature-four": "Cálculo y visualización del total de ingresos y egresos.",
      "feature-five": "Botón para eliminar ingresos o egresos y recalcular el balance automáticamente.",
      "feature-six": "Registro de todo el historial de transacciones.",
      "skill-one": "Primer contacto con la manipulación del DOM en JavaScript.",
      "skill-two": "Implementación de cálculos para obtener totales y porcentajes.",
      "skill-three": "Uso de la librería ECharts para gráficos dinámicos.",
      "skill-four": "Extracción de valores desde inputs y manejo de eventos en JavaScript.",
      "skill-five": "Código modular con archivos JavaScript separados.",
      "skill-six": "Trabajo con clases en JavaScript para una mejor organización del código.",
      "challenge-one": "Lograr que, al eliminar un ingreso o egreso, los cálculos del balance se actualizaran correctamente y se reflejaran en la gráfica. Lo resolví implementando una función `cargaApp` que centraliza todas las funciones necesarias y las ejecuta cada vez que hay un cambio.",
      "challenge-two": "Obtener y gestionar correctamente los valores de los inputs para asignarlos como ingreso o egreso. Lo logré accediendo al DOM junto con eventos y operadores lógicos dentro de una función específica.",
      "challenge-three": "Como era la primera vez usando una librería externa, entender su documentación y hacer que se integrara correctamente con los valores del balance fue un reto. Sin embargo, logré actualizar la gráfica dinámicamente con cada cambio y mostrar los porcentajes correspondientes."
    }
  }
}
